#pragma once
// IWYU pragma private; include "VROSC/FirebaseWrapper.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstdint>
CORDL_MODULE_EXPORT(FirebaseWrapper)
namespace Firebase::Auth {
class FirebaseAuth;
}
namespace Firebase::Auth {
class FirebaseUser;
}
namespace Firebase::Firestore {
class CollectionReference;
}
namespace Firebase::Firestore {
class DocumentReference;
}
namespace Firebase::Firestore {
class DocumentSnapshot;
}
namespace Firebase::Firestore {
class FirebaseFirestore;
}
namespace Firebase::Firestore {
class QuerySnapshot;
}
namespace Firebase::Firestore {
class WriteBatch;
}
namespace Firebase::Storage {
class DownloadState;
}
namespace Firebase::Storage {
class StorageMetadata;
}
namespace Firebase::Storage {
class StorageReference;
}
namespace Firebase::Storage {
class UploadState;
}
namespace Proyecto26 {
class ResponseHelper;
}
namespace System::Collections::Generic {
template<typename TKey,typename TValue>
class Dictionary_2;
}
namespace System::Collections::Generic {
template<typename T>
class IEnumerable_1;
}
namespace System::IO {
class FileStream;
}
namespace System::Threading::Tasks {
template<typename TResult>
class Task_1;
}
namespace System::Threading::Tasks {
class Task;
}
namespace System {
template<typename T>
class Action_1;
}

namespace VROSC {
class FirebaseWrapper___c__DisplayClass88_0;
}
namespace VROSC {
class FirebaseWrapper___c__DisplayClass89_0;
}
namespace VROSC {
class FirebaseWrapper___c__DisplayClass90_0;
}
namespace VROSC {
class FirebaseWrapper___c__DisplayClass91_0;
}
namespace VROSC {
class FirebaseWrapper___c__DisplayClass92_0;
}
namespace VROSC {
class FirebaseWrapper___c__DisplayClass93_0;
}
namespace VROSC {
class FirebaseWrapper___c__DisplayClass93_1;
}
namespace VROSC {
class FirebaseWrapper___c__DisplayClass94_0;
}
namespace VROSC {
class FirebaseWrapper___c__DisplayClass95_0;
}
// Write type traits
MARK_REF_PTR_T(::VROSC::FirebaseWrapper);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass41_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass42_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass44_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass45_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass46_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass48_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass50_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass51_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass52_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass56_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass56_1);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass56_2);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass56_3);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass57_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass58_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass62_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass76_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass78_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass80_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass81_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass82_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass83_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass84_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass85_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass86_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass87_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass88_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass89_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass90_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass91_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass92_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass93_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass93_1);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass94_0);
MARK_REF_PTR_T(::VROSC::FirebaseWrapper___c__DisplayClass95_0);
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass41_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass41_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::FirebaseWrapper*  __4__this;

/// @brief Field onFailure, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action_1<::StringW>*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass41_0* New_ctor() ;

/// @brief Method <CreateUserWithEmail>b__0, addr 0x1838e00, size 0x134, virtual false, abstract: false, final false
inline void _CreateUserWithEmail_b__0(::System::Threading::Tasks::Task_1<::Firebase::Auth::FirebaseUser*>*  task) ;

constexpr ::VROSC::FirebaseWrapper* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::FirebaseWrapper*& __cordl_internal_get___4__this() ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action_1<::StringW>* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action_1<::StringW>*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set___4__this(::VROSC::FirebaseWrapper*  value) ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action_1<::StringW>*  value) ;

/// @brief Method .ctor, addr 0x183435c, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass41_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass41_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass41_0(FirebaseWrapper___c__DisplayClass41_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass41_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass41_0(FirebaseWrapper___c__DisplayClass41_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{340};

/// @brief Field onFailure, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

/// @brief Field onSuccess, offset: 0x18, size: 0x8, def value: None
 ::System::Action_1<::StringW>*  ___onSuccess;

/// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
 ::VROSC::FirebaseWrapper*  _____4__this;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass41_0, ___onFailure) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass41_0, ___onSuccess) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass41_0, _____4__this) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass41_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass42_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass42_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::FirebaseWrapper*  __4__this;

/// @brief Field onFailure, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action_2<::StringW,bool>*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass42_0* New_ctor() ;

/// @brief Method <LoginUserWithEmail>b__0, addr 0x1838f34, size 0x160, virtual false, abstract: false, final false
inline void _LoginUserWithEmail_b__0(::System::Threading::Tasks::Task_1<::Firebase::Auth::FirebaseUser*>*  task) ;

constexpr ::VROSC::FirebaseWrapper* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::FirebaseWrapper*& __cordl_internal_get___4__this() ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action_2<::StringW,bool>* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action_2<::StringW,bool>*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set___4__this(::VROSC::FirebaseWrapper*  value) ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action_2<::StringW,bool>*  value) ;

/// @brief Method .ctor, addr 0x1834364, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass42_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass42_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass42_0(FirebaseWrapper___c__DisplayClass42_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass42_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass42_0(FirebaseWrapper___c__DisplayClass42_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{341};

/// @brief Field onFailure, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

/// @brief Field onSuccess, offset: 0x18, size: 0x8, def value: None
 ::System::Action_2<::StringW,bool>*  ___onSuccess;

/// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
 ::VROSC::FirebaseWrapper*  _____4__this;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass42_0, ___onFailure) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass42_0, ___onSuccess) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass42_0, _____4__this) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass42_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass44_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass44_0 : public ::System::Object {
public:
// Declarations
/// @brief Field email, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_email, put=__cordl_internal_set_email)) ::StringW  email;

/// @brief Field onFailure, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action_1<::StringW>*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass44_0* New_ctor() ;

/// @brief Method <ChangeUserEmail>b__0, addr 0x1839094, size 0x108, virtual false, abstract: false, final false
inline void _ChangeUserEmail_b__0(::System::Threading::Tasks::Task*  task) ;

constexpr ::StringW const& __cordl_internal_get_email() const;

constexpr ::StringW& __cordl_internal_get_email() ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action_1<::StringW>* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action_1<::StringW>*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set_email(::StringW  value) ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action_1<::StringW>*  value) ;

/// @brief Method .ctor, addr 0x183436c, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass44_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass44_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass44_0(FirebaseWrapper___c__DisplayClass44_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass44_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass44_0(FirebaseWrapper___c__DisplayClass44_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{342};

/// @brief Field onFailure, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

/// @brief Field onSuccess, offset: 0x18, size: 0x8, def value: None
 ::System::Action_1<::StringW>*  ___onSuccess;

/// @brief Field email, offset: 0x20, size: 0x8, def value: None
 ::StringW  ___email;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass44_0, ___onFailure) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass44_0, ___onSuccess) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass44_0, ___email) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass44_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass45_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass45_0 : public ::System::Object {
public:
// Declarations
/// @brief Field onFailure, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action_1<::StringW>*  onSuccess;

/// @brief Field password, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_password, put=__cordl_internal_set_password)) ::StringW  password;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass45_0* New_ctor() ;

/// @brief Method <ChangeUserPassword>b__0, addr 0x183919c, size 0x108, virtual false, abstract: false, final false
inline void _ChangeUserPassword_b__0(::System::Threading::Tasks::Task*  task) ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action_1<::StringW>* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action_1<::StringW>*& __cordl_internal_get_onSuccess() ;

constexpr ::StringW const& __cordl_internal_get_password() const;

constexpr ::StringW& __cordl_internal_get_password() ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action_1<::StringW>*  value) ;

constexpr void __cordl_internal_set_password(::StringW  value) ;

/// @brief Method .ctor, addr 0x1834374, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass45_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass45_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass45_0(FirebaseWrapper___c__DisplayClass45_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass45_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass45_0(FirebaseWrapper___c__DisplayClass45_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{343};

/// @brief Field onFailure, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

/// @brief Field onSuccess, offset: 0x18, size: 0x8, def value: None
 ::System::Action_1<::StringW>*  ___onSuccess;

/// @brief Field password, offset: 0x20, size: 0x8, def value: None
 ::StringW  ___password;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass45_0, ___onFailure) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass45_0, ___onSuccess) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass45_0, ___password) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass45_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass46_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass46_0 : public ::System::Object {
public:
// Declarations
/// @brief Field onFailure, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass46_0* New_ctor() ;

/// @brief Method <ResetPassword>b__0, addr 0x18392a4, size 0x104, virtual false, abstract: false, final false
inline void _ResetPassword_b__0(::System::Threading::Tasks::Task*  task) ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action*  value) ;

/// @brief Method .ctor, addr 0x183437c, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass46_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass46_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass46_0(FirebaseWrapper___c__DisplayClass46_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass46_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass46_0(FirebaseWrapper___c__DisplayClass46_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{344};

/// @brief Field onFailure, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

/// @brief Field onSuccess, offset: 0x18, size: 0x8, def value: None
 ::System::Action*  ___onSuccess;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass46_0, ___onFailure) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass46_0, ___onSuccess) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass46_0, 0x20>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass48_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass48_0 : public ::System::Object {
public:
// Declarations
/// @brief Field onFailure, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass48_0* New_ctor() ;

/// @brief Method <SendVerificationEmail>b__0, addr 0x18393a8, size 0x104, virtual false, abstract: false, final false
inline void _SendVerificationEmail_b__0(::System::Threading::Tasks::Task*  task) ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action*  value) ;

/// @brief Method .ctor, addr 0x1834384, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass48_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass48_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass48_0(FirebaseWrapper___c__DisplayClass48_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass48_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass48_0(FirebaseWrapper___c__DisplayClass48_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{345};

/// @brief Field onFailure, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

/// @brief Field onSuccess, offset: 0x18, size: 0x8, def value: None
 ::System::Action*  ___onSuccess;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass48_0, ___onFailure) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass48_0, ___onSuccess) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass48_0, 0x20>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass50_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass50_0 : public ::System::Object {
public:
// Declarations
/// @brief Field onFailure, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass50_0* New_ctor() ;

/// @brief Method <CommitFirestoreBatchWrite>b__0, addr 0x18394ac, size 0x1b8, virtual false, abstract: false, final false
inline void _CommitFirestoreBatchWrite_b__0(::System::Threading::Tasks::Task*  task) ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action*  value) ;

/// @brief Method .ctor, addr 0x18345ac, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass50_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass50_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass50_0(FirebaseWrapper___c__DisplayClass50_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass50_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass50_0(FirebaseWrapper___c__DisplayClass50_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{346};

/// @brief Field onFailure, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

/// @brief Field onSuccess, offset: 0x18, size: 0x8, def value: None
 ::System::Action*  ___onSuccess;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass50_0, ___onFailure) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass50_0, ___onSuccess) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass50_0, 0x20>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass51_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass51_0 : public ::System::Object {
public:
// Declarations
/// @brief Field onSuccess, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass51_0* New_ctor() ;

/// @brief Method <GetUserSessions>b__0, addr 0x1839664, size 0x1c, virtual false, abstract: false, final false
inline void _GetUserSessions_b__0(::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*  sessionsDocuments) ;

constexpr ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set_onSuccess(::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  value) ;

/// @brief Method .ctor, addr 0x18347b4, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass51_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass51_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass51_0(FirebaseWrapper___c__DisplayClass51_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass51_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass51_0(FirebaseWrapper___c__DisplayClass51_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{347};

/// @brief Field onSuccess, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  ___onSuccess;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass51_0, ___onSuccess) == 0x10, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass51_0, 0x18>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass52_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass52_0 : public ::System::Object {
public:
// Declarations
/// @brief Field onSuccess, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass52_0* New_ctor() ;

/// @brief Method <GetUserPreferences>b__0, addr 0x1839680, size 0x504, virtual false, abstract: false, final false
inline void _GetUserPreferences_b__0(::System::Collections::Generic::IEnumerable_1<::Firebase::Firestore::DocumentSnapshot*>*  preferencesDocuments) ;

constexpr ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set_onSuccess(::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*  value) ;

/// @brief Method .ctor, addr 0x1834a60, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass52_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass52_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass52_0(FirebaseWrapper___c__DisplayClass52_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass52_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass52_0(FirebaseWrapper___c__DisplayClass52_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{348};

/// @brief Field onSuccess, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*  ___onSuccess;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass52_0, ___onSuccess) == 0x10, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass52_0, 0x18>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass56_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass56_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::FirebaseWrapper*  __4__this;

/// @brief Field onSuccess, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass56_0* New_ctor() ;

/// @brief Method <GetUserFavorites>b__0, addr 0x1839b84, size 0x58c, virtual false, abstract: false, final false
inline void _GetUserFavorites_b__0(::System::Collections::Generic::IEnumerable_1<::Firebase::Firestore::DocumentSnapshot*>*  favoritesDocuments) ;

constexpr ::VROSC::FirebaseWrapper* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::FirebaseWrapper*& __cordl_internal_get___4__this() ;

constexpr ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set___4__this(::VROSC::FirebaseWrapper*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  value) ;

/// @brief Method .ctor, addr 0x18351a0, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass56_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass56_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass56_0(FirebaseWrapper___c__DisplayClass56_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass56_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass56_0(FirebaseWrapper___c__DisplayClass56_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{349};

/// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
 ::VROSC::FirebaseWrapper*  _____4__this;

/// @brief Field onSuccess, offset: 0x18, size: 0x8, def value: None
 ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  ___onSuccess;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass56_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass56_0, ___onSuccess) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass56_0, 0x20>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass56_1
class CORDL_TYPE FirebaseWrapper___c__DisplayClass56_1 : public ::System::Object {
public:
// Declarations
/// @brief Field CS$<>8__locals1, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_CS$__8__locals1, put=__cordl_internal_set_CS$__8__locals1)) ::VROSC::FirebaseWrapper___c__DisplayClass56_0*  CS$__8__locals1;

/// @brief Field result, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_result, put=__cordl_internal_set_result)) ::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*  result;

/// @brief Field sessionCount, offset 0x18, size 0x4 
 __declspec(property(get=__cordl_internal_get_sessionCount, put=__cordl_internal_set_sessionCount)) int32_t  sessionCount;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass56_1* New_ctor() ;

constexpr ::VROSC::FirebaseWrapper___c__DisplayClass56_0* const& __cordl_internal_get_CS$__8__locals1() const;

constexpr ::VROSC::FirebaseWrapper___c__DisplayClass56_0*& __cordl_internal_get_CS$__8__locals1() ;

constexpr ::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>* const& __cordl_internal_get_result() const;

constexpr ::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*& __cordl_internal_get_result() ;

constexpr int32_t const& __cordl_internal_get_sessionCount() const;

constexpr int32_t& __cordl_internal_get_sessionCount() ;

constexpr void __cordl_internal_set_CS$__8__locals1(::VROSC::FirebaseWrapper___c__DisplayClass56_0*  value) ;

constexpr void __cordl_internal_set_result(::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*  value) ;

constexpr void __cordl_internal_set_sessionCount(int32_t  value) ;

/// @brief Method .ctor, addr 0x183a110, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass56_1() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass56_1", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass56_1(FirebaseWrapper___c__DisplayClass56_1 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass56_1", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass56_1(FirebaseWrapper___c__DisplayClass56_1 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{350};

/// @brief Field result, offset: 0x10, size: 0x8, def value: None
 ::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*  ___result;

/// @brief Field sessionCount, offset: 0x18, size: 0x4, def value: None
 int32_t  ___sessionCount;

/// @brief Field CS$<>8__locals1, offset: 0x20, size: 0x8, def value: None
 ::VROSC::FirebaseWrapper___c__DisplayClass56_0*  ___CS$__8__locals1;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass56_1, ___result) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass56_1, ___sessionCount) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass56_1, ___CS$__8__locals1) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass56_1, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass56_2
class CORDL_TYPE FirebaseWrapper___c__DisplayClass56_2 : public ::System::Object {
public:
// Declarations
/// @brief Field CS$<>8__locals2, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_CS$__8__locals2, put=__cordl_internal_set_CS$__8__locals2)) ::VROSC::FirebaseWrapper___c__DisplayClass56_1*  CS$__8__locals2;

/// @brief Field favoriteDocument, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_favoriteDocument, put=__cordl_internal_set_favoriteDocument)) ::Firebase::Firestore::DocumentSnapshot*  favoriteDocument;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass56_2* New_ctor() ;

/// @brief Method <GetUserFavorites>b__1, addr 0x183a128, size 0x118, virtual false, abstract: false, final false
inline void _GetUserFavorites_b__1(::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*  sessionDocDict) ;

constexpr ::VROSC::FirebaseWrapper___c__DisplayClass56_1* const& __cordl_internal_get_CS$__8__locals2() const;

constexpr ::VROSC::FirebaseWrapper___c__DisplayClass56_1*& __cordl_internal_get_CS$__8__locals2() ;

constexpr ::Firebase::Firestore::DocumentSnapshot* const& __cordl_internal_get_favoriteDocument() const;

constexpr ::Firebase::Firestore::DocumentSnapshot*& __cordl_internal_get_favoriteDocument() ;

constexpr void __cordl_internal_set_CS$__8__locals2(::VROSC::FirebaseWrapper___c__DisplayClass56_1*  value) ;

constexpr void __cordl_internal_set_favoriteDocument(::Firebase::Firestore::DocumentSnapshot*  value) ;

/// @brief Method .ctor, addr 0x183a118, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass56_2() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass56_2", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass56_2(FirebaseWrapper___c__DisplayClass56_2 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass56_2", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass56_2(FirebaseWrapper___c__DisplayClass56_2 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{351};

/// @brief Field favoriteDocument, offset: 0x10, size: 0x8, def value: None
 ::Firebase::Firestore::DocumentSnapshot*  ___favoriteDocument;

/// @brief Field CS$<>8__locals2, offset: 0x18, size: 0x8, def value: None
 ::VROSC::FirebaseWrapper___c__DisplayClass56_1*  ___CS$__8__locals2;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass56_2, ___favoriteDocument) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass56_2, ___CS$__8__locals2) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass56_2, 0x20>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass56_3
class CORDL_TYPE FirebaseWrapper___c__DisplayClass56_3 : public ::System::Object {
public:
// Declarations
/// @brief Field CS$<>8__locals3, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_CS$__8__locals3, put=__cordl_internal_set_CS$__8__locals3)) ::VROSC::FirebaseWrapper___c__DisplayClass56_2*  CS$__8__locals3;

/// @brief Field sessionId, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_sessionId, put=__cordl_internal_set_sessionId)) ::StringW  sessionId;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass56_3* New_ctor() ;

/// @brief Method <GetUserFavorites>b__2, addr 0x183a240, size 0xe8, virtual false, abstract: false, final false
inline void _GetUserFavorites_b__2(::VROSC::Error  error) ;

constexpr ::VROSC::FirebaseWrapper___c__DisplayClass56_2* const& __cordl_internal_get_CS$__8__locals3() const;

constexpr ::VROSC::FirebaseWrapper___c__DisplayClass56_2*& __cordl_internal_get_CS$__8__locals3() ;

constexpr ::StringW const& __cordl_internal_get_sessionId() const;

constexpr ::StringW& __cordl_internal_get_sessionId() ;

constexpr void __cordl_internal_set_CS$__8__locals3(::VROSC::FirebaseWrapper___c__DisplayClass56_2*  value) ;

constexpr void __cordl_internal_set_sessionId(::StringW  value) ;

/// @brief Method .ctor, addr 0x183a120, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass56_3() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass56_3", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass56_3(FirebaseWrapper___c__DisplayClass56_3 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass56_3", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass56_3(FirebaseWrapper___c__DisplayClass56_3 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{352};

/// @brief Field sessionId, offset: 0x10, size: 0x8, def value: None
 ::StringW  ___sessionId;

/// @brief Field CS$<>8__locals3, offset: 0x18, size: 0x8, def value: None
 ::VROSC::FirebaseWrapper___c__DisplayClass56_2*  ___CS$__8__locals3;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass56_3, ___sessionId) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass56_3, ___CS$__8__locals3) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass56_3, 0x20>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass57_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass57_0 : public ::System::Object {
public:
// Declarations
/// @brief Field onSuccess, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass57_0* New_ctor() ;

/// @brief Method <GetUserUpVotes>b__0, addr 0x183a328, size 0x1c, virtual false, abstract: false, final false
inline void _GetUserUpVotes_b__0(::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*  upVotesDocuments) ;

constexpr ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set_onSuccess(::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  value) ;

/// @brief Method .ctor, addr 0x18353a8, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass57_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass57_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass57_0(FirebaseWrapper___c__DisplayClass57_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass57_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass57_0(FirebaseWrapper___c__DisplayClass57_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{353};

/// @brief Field onSuccess, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  ___onSuccess;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass57_0, ___onSuccess) == 0x10, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass57_0, 0x18>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass58_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass58_0 : public ::System::Object {
public:
// Declarations
/// @brief Field onSuccess, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass58_0* New_ctor() ;

/// @brief Method <GetCommunitySessions>b__0, addr 0x183a344, size 0x1c, virtual false, abstract: false, final false
inline void _GetCommunitySessions_b__0(::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*  sessionsDocuments) ;

constexpr ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set_onSuccess(::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  value) ;

/// @brief Method .ctor, addr 0x18354e8, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass58_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass58_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass58_0(FirebaseWrapper___c__DisplayClass58_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass58_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass58_0(FirebaseWrapper___c__DisplayClass58_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{354};

/// @brief Field onSuccess, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::System::Collections::Generic::Dictionary_2<::StringW,::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*>*>*  ___onSuccess;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass58_0, ___onSuccess) == 0x10, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass58_0, 0x18>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass62_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass62_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::FirebaseWrapper*  __4__this;

/// @brief Field data, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_data, put=__cordl_internal_set_data)) ::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*  data;

/// @brief Field onSuccess, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass62_0* New_ctor() ;

/// @brief Method <SaveUserProfile>b__0, addr 0x183a360, size 0xe8, virtual false, abstract: false, final false
inline void _SaveUserProfile_b__0() ;

constexpr ::VROSC::FirebaseWrapper* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::FirebaseWrapper*& __cordl_internal_get___4__this() ;

constexpr ::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>* const& __cordl_internal_get_data() const;

constexpr ::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*& __cordl_internal_get_data() ;

constexpr ::System::Action* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set___4__this(::VROSC::FirebaseWrapper*  value) ;

constexpr void __cordl_internal_set_data(::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action*  value) ;

/// @brief Method .ctor, addr 0x1835d50, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass62_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass62_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass62_0(FirebaseWrapper___c__DisplayClass62_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass62_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass62_0(FirebaseWrapper___c__DisplayClass62_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{355};

/// @brief Field onSuccess, offset: 0x10, size: 0x8, def value: None
 ::System::Action*  ___onSuccess;

/// @brief Field data, offset: 0x18, size: 0x8, def value: None
 ::System::Collections::Generic::Dictionary_2<::StringW,::System::Object*>*  ___data;

/// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
 ::VROSC::FirebaseWrapper*  _____4__this;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass62_0, ___onSuccess) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass62_0, ___data) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass62_0, _____4__this) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::FirebaseWrapper___c__DisplayClass62_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.FirebaseWrapper/<>c__DisplayClass76_0
class CORDL_TYPE FirebaseWrapper___c__DisplayClass76_0 : public ::System::Object {
public:
// Declarations
/// @brief Field docId, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_docId, put=__cordl_internal_set_docId)) ::StringW  docId;

/// @brief Field onSuccess, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action_1<::StringW>*  onSuccess;

static inline ::VROSC::FirebaseWrapper___c__DisplayClass76_0* New_ctor() ;

/// @brief Method <AddSessionUpVote>b__0, addr 0x183a448, size 0x8, virtual false, abstract: false, final false
inline void _AddSessionUpVote_b__0(::StringW  id) ;

/// @brief Method <AddSessionUpVote>b__1, addr 0x183a450, size 0x20, virtual false, abstract: false, final false
inline void _AddSessionUpVote_b__1() ;

constexpr ::StringW const& __cordl_internal_get_docId() const;

constexpr ::StringW& __cordl_internal_get_docId() ;

constexpr ::System::Action_1<::StringW>* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action_1<::StringW>*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set_docId(::StringW  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action_1<::StringW>*  value) ;

/// @brief Method .ctor, addr 0x183731c, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr FirebaseWrapper___c__DisplayClass76_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass76_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
FirebaseWrapper___c__DisplayClass76_0(FirebaseWrapper___c__DisplayClass76_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "FirebaseWrapper___c__DisplayClass76_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
FirebaseWrapper___c__DisplayClass76_0(FirebaseWrapper___c__DisplayClass76_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{356};

/// @brief Field onSuccess, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::StringW>*  ___onSuccess;

/// @brief Field docId, offset: 0x18, size: 0x8, def value: None
 ::StringW  ___docId;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::FirebaseWrapper___c__DisplayClass76_0, ___onSuccess) == 0x10, "Offset mismatch!");

