#pragma once
// IWYU pragma private; include "VROSC/SessionsManager.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/Collections/Generic/zzzz__IEnumerator_1_def.hpp"
#include "System/Collections/zzzz__IEnumerator_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__AsyncVoidMethodBuilder_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__IAsyncStateMachine_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__TaskAwaiter_def.hpp"
#include "System/zzzz__IDisposable_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(SessionsManager)
namespace System::Collections::Generic {
template<typename T>
class List_1;
}
namespace System::Collections {
class IEnumerator;
}
namespace System::Runtime::CompilerServices {
class IAsyncStateMachine;
}
namespace System {
template<typename T>
class Action_1;
}
namespace System {
template<typename T1,typename T2>
class Action_2;
}
namespace System {
template<typename T1,typename T2,typename T3>
class Action_3;
}
namespace System {
class Action;
}
namespace System {
class Object;
}
namespace UnityEngine {
class AudioClip;
}
namespace VROSC {
class CloudSessionsDataController;
}
namespace VROSC {
class CommunitySessionsDataController;
}
namespace VROSC {
struct Error;
}
namespace VROSC {

class SessionsManager___c__DisplayClass60_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass68_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass68_1;
}
namespace VROSC {
class SessionsManager___c__DisplayClass69_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass70_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass71_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass71_1;
}
namespace VROSC {
class SessionsManager___c__DisplayClass78_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass78_1;
}
namespace VROSC {
class SessionsManager___c__DisplayClass79_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass79_1;
}
namespace VROSC {
class SessionsManager___c__DisplayClass80_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass80_1;
}
namespace VROSC {
class SessionsManager___c__DisplayClass81_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass81_1;
}
namespace VROSC {
class SessionsManager___c__DisplayClass82_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass83_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass85_0;
}
namespace VROSC {
class SessionsManager___c__DisplayClass90_0;
}
namespace VROSC {
struct SessionsManager__ExportSession_d__70;
}
// Write type traits
MARK_REF_PTR_T(::VROSC::SessionsManager);
MARK_REF_PTR_T(::VROSC::SessionsManager__SaveSessionAs_d__69);
MARK_REF_PTR_T(::VROSC::SessionsManager__SaveSession_d__68);
MARK_REF_PTR_T(::VROSC::SessionsManager___c);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass58_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass59_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass60_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass68_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass68_1);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass69_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass70_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass71_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass71_1);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass78_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass78_1);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass79_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass79_1);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass80_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass80_1);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass81_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass81_1);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass82_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass83_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass85_0);
MARK_REF_PTR_T(::VROSC::SessionsManager___c__DisplayClass90_0);
MARK_VAL_T(::VROSC::SessionsManager__ExportSession_d__70);
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c
class CORDL_TYPE SessionsManager___c : public ::System::Object {
public:
// Declarations
/// @brief Field <>9, offset 0xffffffff, size 0x8 
 __declspec(property(get=getStaticF___9, put=setStaticF___9)) ::VROSC::SessionsManager___c*  __9;

/// @brief Field <>9__67_0, offset 0xffffffff, size 0x8 
 __declspec(property(get=getStaticF___9__67_0, put=setStaticF___9__67_0)) ::System::Action_1<::VROSC::Error>*  __9__67_0;

/// @brief Field <>9__70_0, offset 0xffffffff, size 0x8 
 __declspec(property(get=getStaticF___9__70_0, put=setStaticF___9__70_0)) ::System::Action*  __9__70_0;

/// @brief Field <>9__70_11, offset 0xffffffff, size 0x8 
 __declspec(property(get=getStaticF___9__70_11, put=setStaticF___9__70_11)) ::System::Action*  __9__70_11;

/// @brief Field <>9__70_13, offset 0xffffffff, size 0x8 
 __declspec(property(get=getStaticF___9__70_13, put=setStaticF___9__70_13)) ::System::Action*  __9__70_13;

/// @brief Field <>9__70_2, offset 0xffffffff, size 0x8 
 __declspec(property(get=getStaticF___9__70_2, put=setStaticF___9__70_2)) ::System::Action*  __9__70_2;

/// @brief Field <>9__70_5, offset 0xffffffff, size 0x8 
 __declspec(property(get=getStaticF___9__70_5, put=setStaticF___9__70_5)) ::System::Action_2<bool,float_t>*  __9__70_5;

/// @brief Field <>9__70_8, offset 0xffffffff, size 0x8 
 __declspec(property(get=getStaticF___9__70_8, put=setStaticF___9__70_8)) ::System::Action_2<bool,float_t>*  __9__70_8;

static inline ::VROSC::SessionsManager___c* New_ctor() ;

/// @brief Method <ExportSession>b__70_0, addr 0x1860900, size 0x4, virtual false, abstract: false, final false
inline void _ExportSession_b__70_0() ;

/// @brief Method <ExportSession>b__70_11, addr 0x1860910, size 0x4, virtual false, abstract: false, final false
inline void _ExportSession_b__70_11() ;

/// @brief Method <ExportSession>b__70_13, addr 0x1860914, size 0x4, virtual false, abstract: false, final false
inline void _ExportSession_b__70_13() ;

/// @brief Method <ExportSession>b__70_2, addr 0x1860904, size 0x4, virtual false, abstract: false, final false
inline void _ExportSession_b__70_2() ;

/// @brief Method <ExportSession>b__70_5, addr 0x1860908, size 0x4, virtual false, abstract: false, final false
inline void _ExportSession_b__70_5(bool  unknownBoolValue, float_t  normalizeMultiplier) ;

/// @brief Method <ExportSession>b__70_8, addr 0x186090c, size 0x4, virtual false, abstract: false, final false
inline void _ExportSession_b__70_8(bool  unknownBoolValue, float_t  normalizeMultiplier) ;

/// @brief Method <RemoveSessionAsTemplate>b__67_0, addr 0x1860820, size 0xe0, virtual false, abstract: false, final false
inline void _RemoveSessionAsTemplate_b__67_0(::VROSC::Error  error) ;

/// @brief Method .ctor, addr 0x1860818, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

static inline ::VROSC::SessionsManager___c* getStaticF___9() ;

static inline ::System::Action_1<::VROSC::Error>* getStaticF___9__67_0() ;

static inline ::System::Action* getStaticF___9__70_0() ;

static inline ::System::Action* getStaticF___9__70_11() ;

static inline ::System::Action* getStaticF___9__70_13() ;

static inline ::System::Action* getStaticF___9__70_2() ;

static inline ::System::Action_2<bool,float_t>* getStaticF___9__70_5() ;

static inline ::System::Action_2<bool,float_t>* getStaticF___9__70_8() ;

static inline void setStaticF___9(::VROSC::SessionsManager___c*  value) ;

static inline void setStaticF___9__67_0(::System::Action_1<::VROSC::Error>*  value) ;

static inline void setStaticF___9__70_0(::System::Action*  value) ;

static inline void setStaticF___9__70_11(::System::Action*  value) ;

static inline void setStaticF___9__70_13(::System::Action*  value) ;

static inline void setStaticF___9__70_2(::System::Action*  value) ;

static inline void setStaticF___9__70_5(::System::Action_2<bool,float_t>*  value) ;

static inline void setStaticF___9__70_8(::System::Action_2<bool,float_t>*  value) ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c(SessionsManager___c && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c(SessionsManager___c const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{481};

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c, 0x10>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass58_0
class CORDL_TYPE SessionsManager___c__DisplayClass58_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::SessionsManager*  __4__this;

/// @brief Field onFailure, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action*  onSuccess;

static inline ::VROSC::SessionsManager___c__DisplayClass58_0* New_ctor() ;

/// @brief Method <LoadLocalSessions>b__0, addr 0x1860918, size 0xac, virtual false, abstract: false, final false
inline void _LoadLocalSessions_b__0() ;

/// @brief Method <LoadLocalSessions>b__1, addr 0x18609c4, size 0x8c, virtual false, abstract: false, final false
inline void _LoadLocalSessions_b__1(::VROSC::Error  error) ;

constexpr ::VROSC::SessionsManager* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::SessionsManager*& __cordl_internal_get___4__this() ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set___4__this(::VROSC::SessionsManager*  value) ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action*  value) ;

/// @brief Method .ctor, addr 0x185c0e0, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass58_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass58_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass58_0(SessionsManager___c__DisplayClass58_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass58_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass58_0(SessionsManager___c__DisplayClass58_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{482};

/// @brief Field onSuccess, offset: 0x10, size: 0x8, def value: None
 ::System::Action*  ___onSuccess;

/// @brief Field <>4__this, offset: 0x18, size: 0x8, def value: None
 ::VROSC::SessionsManager*  _____4__this;

/// @brief Field onFailure, offset: 0x20, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass58_0, ___onSuccess) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass58_0, _____4__this) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass58_0, ___onFailure) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass58_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass59_0
class CORDL_TYPE SessionsManager___c__DisplayClass59_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::SessionsManager*  __4__this;

/// @brief Field onFailure, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action*  onSuccess;

static inline ::VROSC::SessionsManager___c__DisplayClass59_0* New_ctor() ;

/// @brief Method <LoadCloudSessions>b__0, addr 0x1860a50, size 0xac, virtual false, abstract: false, final false
inline void _LoadCloudSessions_b__0() ;

/// @brief Method <LoadCloudSessions>b__1, addr 0x1860afc, size 0x8c, virtual false, abstract: false, final false
inline void _LoadCloudSessions_b__1(::VROSC::Error  error) ;

constexpr ::VROSC::SessionsManager* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::SessionsManager*& __cordl_internal_get___4__this() ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set___4__this(::VROSC::SessionsManager*  value) ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action*  value) ;

/// @brief Method .ctor, addr 0x185c200, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass59_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass59_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass59_0(SessionsManager___c__DisplayClass59_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass59_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass59_0(SessionsManager___c__DisplayClass59_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{483};

/// @brief Field onSuccess, offset: 0x10, size: 0x8, def value: None
 ::System::Action*  ___onSuccess;

/// @brief Field <>4__this, offset: 0x18, size: 0x8, def value: None
 ::VROSC::SessionsManager*  _____4__this;

/// @brief Field onFailure, offset: 0x20, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass59_0, ___onSuccess) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass59_0, _____4__this) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass59_0, ___onFailure) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass59_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass60_0
class CORDL_TYPE SessionsManager___c__DisplayClass60_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::SessionsManager*  __4__this;

/// @brief Field onFailure, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action*  onSuccess;

static inline ::VROSC::SessionsManager___c__DisplayClass60_0* New_ctor() ;

/// @brief Method <LoadCommunitySessions>b__0, addr 0x1860b88, size 0xac, virtual false, abstract: false, final false
inline void _LoadCommunitySessions_b__0() ;

/// @brief Method <LoadCommunitySessions>b__1, addr 0x1860c34, size 0x98, virtual false, abstract: false, final false
inline void _LoadCommunitySessions_b__1(::VROSC::Error  error) ;

constexpr ::VROSC::SessionsManager* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::SessionsManager*& __cordl_internal_get___4__this() ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action*& __cordl_internal_get_onSuccess() ;

constexpr void __cordl_internal_set___4__this(::VROSC::SessionsManager*  value) ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action*  value) ;

/// @brief Method .ctor, addr 0x185c320, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass60_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass60_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass60_0(SessionsManager___c__DisplayClass60_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass60_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass60_0(SessionsManager___c__DisplayClass60_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{484};

/// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
 ::VROSC::SessionsManager*  _____4__this;

/// @brief Field onSuccess, offset: 0x18, size: 0x8, def value: None
 ::System::Action*  ___onSuccess;

/// @brief Field onFailure, offset: 0x20, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass60_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass60_0, ___onSuccess) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass60_0, ___onFailure) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass60_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass68_0
class CORDL_TYPE SessionsManager___c__DisplayClass68_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::SessionsManager*  __4__this;

/// @brief Field newSessionDataController, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_newSessionDataController, put=__cordl_internal_set_newSessionDataController)) ::VROSC::SessionsDataController*  newSessionDataController;

/// @brief Field sessionSaveData, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_sessionSaveData, put=__cordl_internal_set_sessionSaveData)) ::VROSC::SessionSaveData*  sessionSaveData;

static inline ::VROSC::SessionsManager___c__DisplayClass68_0* New_ctor() ;

/// @brief Method <SaveSession>b__2, addr 0x1860e50, size 0x120, virtual false, abstract: false, final false
inline void _SaveSession_b__2(::VROSC::Error  error) ;

/// @brief Method <SaveSession>g__localDelete|3, addr 0x1860cd4, size 0x17c, virtual false, abstract: false, final false
inline void _SaveSession_g__localDelete_3(::StringW  sessionId) ;

constexpr ::VROSC::SessionsManager* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::SessionsManager*& __cordl_internal_get___4__this() ;

constexpr ::VROSC::SessionsDataController* const& __cordl_internal_get_newSessionDataController() const;

constexpr ::VROSC::SessionsDataController*& __cordl_internal_get_newSessionDataController() ;

constexpr ::VROSC::SessionSaveData* const& __cordl_internal_get_sessionSaveData() const;

constexpr ::VROSC::SessionSaveData*& __cordl_internal_get_sessionSaveData() ;

constexpr void __cordl_internal_set___4__this(::VROSC::SessionsManager*  value) ;

constexpr void __cordl_internal_set_newSessionDataController(::VROSC::SessionsDataController*  value) ;

constexpr void __cordl_internal_set_sessionSaveData(::VROSC::SessionSaveData*  value) ;

/// @brief Method .ctor, addr 0x1860ccc, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass68_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass68_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass68_0(SessionsManager___c__DisplayClass68_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass68_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass68_0(SessionsManager___c__DisplayClass68_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{485};

/// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
 ::VROSC::SessionsManager*  _____4__this;

/// @brief Field newSessionDataController, offset: 0x18, size: 0x8, def value: None
 ::VROSC::SessionsDataController*  ___newSessionDataController;

/// @brief Field sessionSaveData, offset: 0x20, size: 0x8, def value: None
 ::VROSC::SessionSaveData*  ___sessionSaveData;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass68_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass68_0, ___newSessionDataController) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass68_0, ___sessionSaveData) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass68_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass68_1
class CORDL_TYPE SessionsManager___c__DisplayClass68_1 : public ::System::Object {
public:
// Declarations
/// @brief Field CS$<>8__locals1, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_CS$__8__locals1, put=__cordl_internal_set_CS$__8__locals1)) ::VROSC::SessionsManager___c__DisplayClass68_0*  CS$__8__locals1;

/// @brief Field areAnchorsReady, offset 0x10, size 0x1 
 __declspec(property(get=__cordl_internal_get_areAnchorsReady, put=__cordl_internal_set_areAnchorsReady)) bool  areAnchorsReady;

/// @brief Field newSessionId, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_newSessionId, put=__cordl_internal_set_newSessionId)) ::StringW  newSessionId;

static inline ::VROSC::SessionsManager___c__DisplayClass68_1* New_ctor() ;

/// @brief Method <SaveSession>b__0, addr 0x1860f78, size 0xc, virtual false, abstract: false, final false
inline void _SaveSession_b__0() ;

/// @brief Method <SaveSession>b__1, addr 0x1860f84, size 0x694, virtual false, abstract: false, final false
inline void _SaveSession_b__1() ;

constexpr ::VROSC::SessionsManager___c__DisplayClass68_0* const& __cordl_internal_get_CS$__8__locals1() const;

constexpr ::VROSC::SessionsManager___c__DisplayClass68_0*& __cordl_internal_get_CS$__8__locals1() ;

constexpr bool const& __cordl_internal_get_areAnchorsReady() const;

constexpr bool& __cordl_internal_get_areAnchorsReady() ;

constexpr ::StringW const& __cordl_internal_get_newSessionId() const;

constexpr ::StringW& __cordl_internal_get_newSessionId() ;

constexpr void __cordl_internal_set_CS$__8__locals1(::VROSC::SessionsManager___c__DisplayClass68_0*  value) ;

constexpr void __cordl_internal_set_areAnchorsReady(bool  value) ;

constexpr void __cordl_internal_set_newSessionId(::StringW  value) ;

/// @brief Method .ctor, addr 0x1860f70, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass68_1() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass68_1", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass68_1(SessionsManager___c__DisplayClass68_1 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass68_1", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass68_1(SessionsManager___c__DisplayClass68_1 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{486};

/// @brief Field areAnchorsReady, offset: 0x10, size: 0x1, def value: None
 bool  ___areAnchorsReady;

/// @brief Field newSessionId, offset: 0x18, size: 0x8, def value: None
 ::StringW  ___newSessionId;

/// @brief Field CS$<>8__locals1, offset: 0x20, size: 0x8, def value: None
 ::VROSC::SessionsManager___c__DisplayClass68_0*  ___CS$__8__locals1;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass68_1, ___areAnchorsReady) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass68_1, ___newSessionId) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass68_1, ___CS$__8__locals1) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass68_1, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass69_0
class CORDL_TYPE SessionsManager___c__DisplayClass69_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::SessionsManager*  __4__this;

/// @brief Field areAnchorsReady, offset 0x10, size 0x1 
 __declspec(property(get=__cordl_internal_get_areAnchorsReady, put=__cordl_internal_set_areAnchorsReady)) bool  areAnchorsReady;

/// @brief Field sessionId, offset 0x30, size 0x8 
 __declspec(property(get=__cordl_internal_get_sessionId, put=__cordl_internal_set_sessionId)) ::StringW  sessionId;

/// @brief Field sessionSaveData, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_sessionSaveData, put=__cordl_internal_set_sessionSaveData)) ::VROSC::SessionSaveData*  sessionSaveData;

/// @brief Field sessionsDataController, offset 0x28, size 0x8 
 __declspec(property(get=__cordl_internal_get_sessionsDataController, put=__cordl_internal_set_sessionsDataController)) ::VROSC::SessionsDataController*  sessionsDataController;

static inline ::VROSC::SessionsManager___c__DisplayClass69_0* New_ctor() ;

/// @brief Method <SaveSessionAs>b__0, addr 0x1861620, size 0xc, virtual false, abstract: false, final false
inline void _SaveSessionAs_b__0() ;

/// @brief Method <SaveSessionAs>b__1, addr 0x186162c, size 0x568, virtual false, abstract: false, final false
inline void _SaveSessionAs_b__1() ;

/// @brief Method <SaveSessionAs>b__2, addr 0x1861b94, size 0x110, virtual false, abstract: false, final false
inline void _SaveSessionAs_b__2(::VROSC::Error  error) ;

constexpr ::VROSC::SessionsManager* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::SessionsManager*& __cordl_internal_get___4__this() ;

constexpr bool const& __cordl_internal_get_areAnchorsReady() const;

constexpr bool& __cordl_internal_get_areAnchorsReady() ;

constexpr ::StringW const& __cordl_internal_get_sessionId() const;

constexpr ::StringW& __cordl_internal_get_sessionId() ;

constexpr ::VROSC::SessionSaveData* const& __cordl_internal_get_sessionSaveData() const;

constexpr ::VROSC::SessionSaveData*& __cordl_internal_get_sessionSaveData() ;

constexpr ::VROSC::SessionsDataController* const& __cordl_internal_get_sessionsDataController() const;

constexpr ::VROSC::SessionsDataController*& __cordl_internal_get_sessionsDataController() ;

constexpr void __cordl_internal_set___4__this(::VROSC::SessionsManager*  value) ;

constexpr void __cordl_internal_set_areAnchorsReady(bool  value) ;

constexpr void __cordl_internal_set_sessionId(::StringW  value) ;

constexpr void __cordl_internal_set_sessionSaveData(::VROSC::SessionSaveData*  value) ;

constexpr void __cordl_internal_set_sessionsDataController(::VROSC::SessionsDataController*  value) ;

/// @brief Method .ctor, addr 0x1861618, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass69_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass69_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass69_0(SessionsManager___c__DisplayClass69_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass69_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass69_0(SessionsManager___c__DisplayClass69_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{487};

/// @brief Field areAnchorsReady, offset: 0x10, size: 0x1, def value: None
 bool  ___areAnchorsReady;

/// @brief Field <>4__this, offset: 0x18, size: 0x8, def value: None
 ::VROSC::SessionsManager*  _____4__this;

/// @brief Field sessionSaveData, offset: 0x20, size: 0x8, def value: None
 ::VROSC::SessionSaveData*  ___sessionSaveData;

/// @brief Field sessionsDataController, offset: 0x28, size: 0x8, def value: None
 ::VROSC::SessionsDataController*  ___sessionsDataController;

/// @brief Field sessionId, offset: 0x30, size: 0x8, def value: None
 ::StringW  ___sessionId;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass69_0, ___areAnchorsReady) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass69_0, _____4__this) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass69_0, ___sessionSaveData) == 0x20, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass69_0, ___sessionsDataController) == 0x28, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass69_0, ___sessionId) == 0x30, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass69_0, 0x38>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass70_0
class CORDL_TYPE SessionsManager___c__DisplayClass70_0 : public ::System::Object {
public:
// Declarations
/// @brief Field audioPreviewProgressWeight, offset 0x24, size 0x4 
 __declspec(property(get=__cordl_internal_get_audioPreviewProgressWeight, put=__cordl_internal_set_audioPreviewProgressWeight)) float_t  audioPreviewProgressWeight;

/// @brief Field loopsProgressWeight, offset 0x20, size 0x4 
 __declspec(property(get=__cordl_internal_get_loopsProgressWeight, put=__cordl_internal_set_loopsProgressWeight)) float_t  loopsProgressWeight;

/// @brief Field onFailure, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onProgress, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_onProgress, put=__cordl_internal_set_onProgress)) ::System::Action_1<float_t>*  onProgress;

static inline ::VROSC::SessionsManager___c__DisplayClass70_0* New_ctor() ;

/// @brief Method <ExportSession>b__1, addr 0x1861cac, size 0x1c, virtual false, abstract: false, final false
inline void _ExportSession_b__1(::VROSC::Error  error) ;

/// @brief Method <ExportSession>b__10, addr 0x1861d68, size 0x28, virtual false, abstract: false, final false
inline void _ExportSession_b__10(float_t  progress) ;

/// @brief Method <ExportSession>b__12, addr 0x1861d90, size 0x1c, virtual false, abstract: false, final false
inline void _ExportSession_b__12(::VROSC::Error  error) ;

/// @brief Method <ExportSession>b__3, addr 0x1861cc8, size 0x1c, virtual false, abstract: false, final false
inline void _ExportSession_b__3(::VROSC::Error  error) ;

/// @brief Method <ExportSession>b__4, addr 0x1861ce4, size 0x24, virtual false, abstract: false, final false
inline void _ExportSession_b__4(float_t  progress) ;

/// @brief Method <ExportSession>b__6, addr 0x1861d08, size 0x1c, virtual false, abstract: false, final false
inline void _ExportSession_b__6(::VROSC::Error  error) ;

/// @brief Method <ExportSession>b__7, addr 0x1861d24, size 0x28, virtual false, abstract: false, final false
inline void _ExportSession_b__7(float_t  progress) ;

/// @brief Method <ExportSession>b__9, addr 0x1861d4c, size 0x1c, virtual false, abstract: false, final false
inline void _ExportSession_b__9(::VROSC::Error  error) ;

constexpr float_t const& __cordl_internal_get_audioPreviewProgressWeight() const;

constexpr float_t& __cordl_internal_get_audioPreviewProgressWeight() ;

constexpr float_t const& __cordl_internal_get_loopsProgressWeight() const;

constexpr float_t& __cordl_internal_get_loopsProgressWeight() ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action_1<float_t>* const& __cordl_internal_get_onProgress() const;

constexpr ::System::Action_1<float_t>*& __cordl_internal_get_onProgress() ;

constexpr void __cordl_internal_set_audioPreviewProgressWeight(float_t  value) ;

constexpr void __cordl_internal_set_loopsProgressWeight(float_t  value) ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onProgress(::System::Action_1<float_t>*  value) ;

/// @brief Method .ctor, addr 0x1861ca4, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass70_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass70_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass70_0(SessionsManager___c__DisplayClass70_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass70_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass70_0(SessionsManager___c__DisplayClass70_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{488};

/// @brief Field onFailure, offset: 0x10, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

/// @brief Field onProgress, offset: 0x18, size: 0x8, def value: None
 ::System::Action_1<float_t>*  ___onProgress;

/// @brief Field loopsProgressWeight, offset: 0x20, size: 0x4, def value: None
 float_t  ___loopsProgressWeight;

/// @brief Field audioPreviewProgressWeight, offset: 0x24, size: 0x4, def value: None
 float_t  ___audioPreviewProgressWeight;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass70_0, ___onFailure) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass70_0, ___onProgress) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass70_0, ___loopsProgressWeight) == 0x20, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass70_0, ___audioPreviewProgressWeight) == 0x24, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass70_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass71_0
class CORDL_TYPE SessionsManager___c__DisplayClass71_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::SessionsManager*  __4__this;

/// @brief Field sessionId, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_sessionId, put=__cordl_internal_set_sessionId)) ::StringW  sessionId;

/// @brief Field sessionsDataController, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_sessionsDataController, put=__cordl_internal_set_sessionsDataController)) ::VROSC::SessionsDataController*  sessionsDataController;

static inline ::VROSC::SessionsManager___c__DisplayClass71_0* New_ctor() ;

/// @brief Method <DeleteSession>b__1, addr 0x1861dac, size 0x80, virtual false, abstract: false, final false
inline void _DeleteSession_b__1(::VROSC::Error  error) ;

constexpr ::VROSC::SessionsManager* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::SessionsManager*& __cordl_internal_get___4__this() ;

constexpr ::StringW const& __cordl_internal_get_sessionId() const;

constexpr ::StringW& __cordl_internal_get_sessionId() ;

constexpr ::VROSC::SessionsDataController* const& __cordl_internal_get_sessionsDataController() const;

constexpr ::VROSC::SessionsDataController*& __cordl_internal_get_sessionsDataController() ;

constexpr void __cordl_internal_set___4__this(::VROSC::SessionsManager*  value) ;

constexpr void __cordl_internal_set_sessionId(::StringW  value) ;

constexpr void __cordl_internal_set_sessionsDataController(::VROSC::SessionsDataController*  value) ;

/// @brief Method .ctor, addr 0x185d8c8, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass71_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass71_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass71_0(SessionsManager___c__DisplayClass71_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass71_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass71_0(SessionsManager___c__DisplayClass71_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{489};

/// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
 ::VROSC::SessionsManager*  _____4__this;

/// @brief Field sessionsDataController, offset: 0x18, size: 0x8, def value: None
 ::VROSC::SessionsDataController*  ___sessionsDataController;

/// @brief Field sessionId, offset: 0x20, size: 0x8, def value: None
 ::StringW  ___sessionId;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass71_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass71_0, ___sessionsDataController) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass71_0, ___sessionId) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass71_0, 0x28>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass71_1
class CORDL_TYPE SessionsManager___c__DisplayClass71_1 : public ::System::Object {
public:
// Declarations
/// @brief Field CS$<>8__locals1, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_CS$__8__locals1, put=__cordl_internal_set_CS$__8__locals1)) ::VROSC::SessionsManager___c__DisplayClass71_0*  CS$__8__locals1;

/// @brief Field isOgg, offset 0x10, size 0x1 
 __declspec(property(get=__cordl_internal_get_isOgg, put=__cordl_internal_set_isOgg)) bool  isOgg;

static inline ::VROSC::SessionsManager___c__DisplayClass71_1* New_ctor() ;

/// @brief Method <DeleteSession>b__0, addr 0x1861e2c, size 0x3a8, virtual false, abstract: false, final false
inline void _DeleteSession_b__0() ;

constexpr ::VROSC::SessionsManager___c__DisplayClass71_0* const& __cordl_internal_get_CS$__8__locals1() const;

constexpr ::VROSC::SessionsManager___c__DisplayClass71_0*& __cordl_internal_get_CS$__8__locals1() ;

constexpr bool const& __cordl_internal_get_isOgg() const;

constexpr bool& __cordl_internal_get_isOgg() ;

constexpr void __cordl_internal_set_CS$__8__locals1(::VROSC::SessionsManager___c__DisplayClass71_0*  value) ;

constexpr void __cordl_internal_set_isOgg(bool  value) ;

/// @brief Method .ctor, addr 0x185d8d0, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass71_1() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass71_1", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass71_1(SessionsManager___c__DisplayClass71_1 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass71_1", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass71_1(SessionsManager___c__DisplayClass71_1 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{490};

/// @brief Field isOgg, offset: 0x10, size: 0x1, def value: None
 bool  ___isOgg;

/// @brief Field CS$<>8__locals1, offset: 0x18, size: 0x8, def value: None
 ::VROSC::SessionsManager___c__DisplayClass71_0*  ___CS$__8__locals1;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass71_1, ___isOgg) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass71_1, ___CS$__8__locals1) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass71_1, 0x20>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass78_0
class CORDL_TYPE SessionsManager___c__DisplayClass78_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::SessionsManager*  __4__this;

/// @brief Field <>9__2, offset 0x48, size 0x8 
 __declspec(property(get=__cordl_internal_get___9__2, put=__cordl_internal_set___9__2)) ::System::Action_1<::StringW>*  __9__2;

/// @brief Field <>9__3, offset 0x50, size 0x8 
 __declspec(property(get=__cordl_internal_get___9__3, put=__cordl_internal_set___9__3)) ::System::Action_1<::VROSC::Error>*  __9__3;

/// @brief Field <>9__4, offset 0x38, size 0x8 
 __declspec(property(get=__cordl_internal_get___9__4, put=__cordl_internal_set___9__4)) ::System::Action_1<::StringW>*  __9__4;

/// @brief Field <>9__5, offset 0x40, size 0x8 
 __declspec(property(get=__cordl_internal_get___9__5, put=__cordl_internal_set___9__5)) ::System::Action_1<::VROSC::Error>*  __9__5;

/// @brief Field <>9__6, offset 0x30, size 0x8 
 __declspec(property(get=__cordl_internal_get___9__6, put=__cordl_internal_set___9__6)) ::System::Action*  __9__6;

/// @brief Field onFailure, offset 0x28, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action*  onSuccess;

/// @brief Field sessionId, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_sessionId, put=__cordl_internal_set_sessionId)) ::StringW  sessionId;

static inline ::VROSC::SessionsManager___c__DisplayClass78_0* New_ctor() ;

/// @brief Method <AddSessionUpVote>b__0, addr 0x18621d4, size 0x220, virtual false, abstract: false, final false
inline void _AddSessionUpVote_b__0() ;

/// @brief Method <AddSessionUpVote>b__1, addr 0x1862838, size 0x9c, virtual false, abstract: false, final false
inline void _AddSessionUpVote_b__1(::VROSC::Error  error) ;

/// @brief Method <AddSessionUpVote>b__2, addr 0x18623f4, size 0x118, virtual false, abstract: false, final false
inline void _AddSessionUpVote_b__2(::StringW  sessionUpVotedId) ;

/// @brief Method <AddSessionUpVote>b__3, addr 0x186279c, size 0x9c, virtual false, abstract: false, final false
inline void _AddSessionUpVote_b__3(::VROSC::Error  error) ;

/// @brief Method <AddSessionUpVote>b__4, addr 0x186250c, size 0x13c, virtual false, abstract: false, final false
inline void _AddSessionUpVote_b__4(::StringW  userUpVoteId) ;

/// @brief Method <AddSessionUpVote>b__5, addr 0x1862700, size 0x9c, virtual false, abstract: false, final false
inline void _AddSessionUpVote_b__5(::VROSC::Error  error) ;

/// @brief Method <AddSessionUpVote>b__6, addr 0x1862650, size 0xb0, virtual false, abstract: false, final false
inline void _AddSessionUpVote_b__6() ;

constexpr ::VROSC::SessionsManager* const& __cordl_internal_get___4__this() const;

constexpr ::VROSC::SessionsManager*& __cordl_internal_get___4__this() ;

constexpr ::System::Action_1<::StringW>* const& __cordl_internal_get___9__2() const;

constexpr ::System::Action_1<::StringW>*& __cordl_internal_get___9__2() ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get___9__3() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get___9__3() ;

constexpr ::System::Action_1<::StringW>* const& __cordl_internal_get___9__4() const;

constexpr ::System::Action_1<::StringW>*& __cordl_internal_get___9__4() ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get___9__5() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get___9__5() ;

constexpr ::System::Action* const& __cordl_internal_get___9__6() const;

constexpr ::System::Action*& __cordl_internal_get___9__6() ;

constexpr ::System::Action_1<::VROSC::Error>* const& __cordl_internal_get_onFailure() const;

constexpr ::System::Action_1<::VROSC::Error>*& __cordl_internal_get_onFailure() ;

constexpr ::System::Action* const& __cordl_internal_get_onSuccess() const;

constexpr ::System::Action*& __cordl_internal_get_onSuccess() ;

constexpr ::StringW const& __cordl_internal_get_sessionId() const;

constexpr ::StringW& __cordl_internal_get_sessionId() ;

constexpr void __cordl_internal_set___4__this(::VROSC::SessionsManager*  value) ;

constexpr void __cordl_internal_set___9__2(::System::Action_1<::StringW>*  value) ;

constexpr void __cordl_internal_set___9__3(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set___9__4(::System::Action_1<::StringW>*  value) ;

constexpr void __cordl_internal_set___9__5(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set___9__6(::System::Action*  value) ;

constexpr void __cordl_internal_set_onFailure(::System::Action_1<::VROSC::Error>*  value) ;

constexpr void __cordl_internal_set_onSuccess(::System::Action*  value) ;

constexpr void __cordl_internal_set_sessionId(::StringW  value) ;

/// @brief Method .ctor, addr 0x185dd18, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass78_0() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass78_0", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass78_0(SessionsManager___c__DisplayClass78_0 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass78_0", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass78_0(SessionsManager___c__DisplayClass78_0 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{491};

/// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
 ::VROSC::SessionsManager*  _____4__this;

/// @brief Field sessionId, offset: 0x18, size: 0x8, def value: None
 ::StringW  ___sessionId;

/// @brief Field onSuccess, offset: 0x20, size: 0x8, def value: None
 ::System::Action*  ___onSuccess;

/// @brief Field onFailure, offset: 0x28, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  ___onFailure;

/// @brief Field <>9__6, offset: 0x30, size: 0x8, def value: None
 ::System::Action*  _____9__6;

/// @brief Field <>9__4, offset: 0x38, size: 0x8, def value: None
 ::System::Action_1<::StringW>*  _____9__4;

/// @brief Field <>9__5, offset: 0x40, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  _____9__5;

/// @brief Field <>9__2, offset: 0x48, size: 0x8, def value: None
 ::System::Action_1<::StringW>*  _____9__2;

/// @brief Field <>9__3, offset: 0x50, size: 0x8, def value: None
 ::System::Action_1<::VROSC::Error>*  _____9__3;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_0, ___sessionId) == 0x18, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_0, ___onSuccess) == 0x20, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_0, ___onFailure) == 0x28, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_0, _____9__6) == 0x30, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_0, _____9__4) == 0x38, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_0, _____9__5) == 0x40, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_0, _____9__2) == 0x48, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_0, _____9__3) == 0x50, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass78_0, 0x58>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass78_1
class CORDL_TYPE SessionsManager___c__DisplayClass78_1 : public ::System::Object {
public:
// Declarations
/// @brief Field CS$<>8__locals1, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_CS$__8__locals1, put=__cordl_internal_set_CS$__8__locals1)) ::VROSC::SessionsManager___c__DisplayClass78_0*  CS$__8__locals1;

/// @brief Field userUpVoteId, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get_userUpVoteId, put=__cordl_internal_set_userUpVoteId)) ::StringW  userUpVoteId;

static inline ::VROSC::SessionsManager___c__DisplayClass78_1* New_ctor() ;

/// @brief Method <AddSessionUpVote>b__7, addr 0x18628d4, size 0xd0, virtual false, abstract: false, final false
inline void _AddSessionUpVote_b__7(::VROSC::Error  error) ;

constexpr ::VROSC::SessionsManager___c__DisplayClass78_0* const& __cordl_internal_get_CS$__8__locals1() const;

constexpr ::VROSC::SessionsManager___c__DisplayClass78_0*& __cordl_internal_get_CS$__8__locals1() ;

constexpr ::StringW const& __cordl_internal_get_userUpVoteId() const;

constexpr ::StringW& __cordl_internal_get_userUpVoteId() ;

constexpr void __cordl_internal_set_CS$__8__locals1(::VROSC::SessionsManager___c__DisplayClass78_0*  value) ;

constexpr void __cordl_internal_set_userUpVoteId(::StringW  value) ;

/// @brief Method .ctor, addr 0x1862648, size 0x8, virtual false, abstract: false, final false
inline void _ctor() ;

protected:
// Ctor Parameters []
// @brief default ctor
constexpr SessionsManager___c__DisplayClass78_1() ;
public:

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass78_1", modifiers: "&&", def_value: None }]
// @brief delete move ctor to prevent accidental deref moves
SessionsManager___c__DisplayClass78_1(SessionsManager___c__DisplayClass78_1 && ) = delete;

// Ctor Parameters [CppParam { name: "", ty: "SessionsManager___c__DisplayClass78_1", modifiers: "const&", def_value: None }]
// @brief delete copy ctor to prevent accidental deref copies
SessionsManager___c__DisplayClass78_1(SessionsManager___c__DisplayClass78_1 const& ) = delete;

/// @brief IL2CPP Metadata Type Index
static constexpr uint32_t  __IL2CPP_TYPE_DEFINITION_INDEX{492};

/// @brief Field userUpVoteId, offset: 0x10, size: 0x8, def value: None
 ::StringW  ___userUpVoteId;

/// @brief Field CS$<>8__locals1, offset: 0x18, size: 0x8, def value: None
 ::VROSC::SessionsManager___c__DisplayClass78_0*  ___CS$__8__locals1;

static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_1, ___userUpVoteId) == 0x10, "Offset mismatch!");

static_assert(offsetof(::VROSC::SessionsManager___c__DisplayClass78_1, ___CS$__8__locals1) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::VROSC::SessionsManager___c__DisplayClass78_1, 0x20>, "Size mismatch!");

} // namespace end def VROSC
// Dependencies System.Object
namespace VROSC {
// Is value type: false
// CS Name: VROSC.SessionsManager/<>c__DisplayClass79_0
class CORDL_TYPE SessionsManager___c__DisplayClass79_0 : public ::System::Object {
public:
// Declarations
/// @brief Field <>4__this, offset 0x10, size 0x8 
 __declspec(property(get=__cordl_internal_get___4__this, put=__cordl_internal_set___4__this)) ::VROSC::SessionsManager*  __4__this;

/// @brief Field <>9__3, offset 0x50, size 0x8 
 __declspec(property(get=__cordl_internal_get___9__3, put=__cordl_internal_set___9__3)) ::System::Action_1<::VROSC::Error>*  __9__3;

/// @brief Field <>9__4, offset 0x40, size 0x8 
 __declspec(property(get=__cordl_internal_get___9__4, put=__cordl_internal_set___9__4)) ::System::Action*  __9__4;

/// @brief Field <>9__5, offset 0x48, size 0x8 
 __declspec(property(get=__cordl_internal_get___9__5, put=__cordl_internal_set___9__5)) ::System::Action_1<::VROSC::Error>*  __9__5;

/// @brief Field <>9__6, offset 0x30, size 0x8 
 __declspec(property(get=__cordl_internal_get___9__6, put=__cordl_internal_set___9__6)) ::System::Action*  __9__6;

/// @brief Field <>9__7, offset 0x38, size 0x8 
 __declspec(property(get=__cordl_internal_get___9__7, put=__cordl_internal_set___9__7)) ::System::Action_1<::VROSC::Error>*  __9__7;

/// @brief Field onFailure, offset 0x28, size 0x8 
 __declspec(property(get=__cordl_internal_get_onFailure, put=__cordl_internal_set_onFailure)) ::System::Action_1<::VROSC::Error>*  onFailure;

/// @brief Field onSuccess, offset 0x20, size 0x8 
 __declspec(property(get=__cordl_internal_get_onSuccess, put=__cordl_internal_set_onSuccess)) ::System::Action*  onSuccess;

/// @brief Field sessionId, offset 0x18, size 0x8 
 __declspec(property(get=__cordl_internal_get_sessionId, put=__cordl_internal_set_sessionId)) ::StringW  sessionId;

static inline ::VROSC::SessionsManager___c__DisplayClass79_0* New_ctor() ;

/// @brief Method <RemoveSessionUpVote>b__0, addr 0x18629a4, size 0x224, virtual false, abstract: false, final false
inline void _RemoveSessionUpVote_b__0() ;

/// @brief Method <RemoveSessionUpVote>b__1, addr 0x1862f54, size 0x9c, virtual false, abstract: false, final false
inline void _RemoveSessionUpVote_b__1(::VROSC::Error  error) ;

/// @brief Method <RemoveSessionUpVote>b__3, addr 0x1862eb8, size 0x9c, virtual false, abstract: false, final false
inline void _RemoveSessionUpVote_b__3(::VROSC::Error  error) ;

/// @brief Method <RemoveSessionUpVote>b__4, addr 0x1862bd0, size 0x10c, virtual false, abstract: false, final false
inline void _RemoveSessionUpVote_b__4() ;

/// @brief Method <RemoveSessionUpVote>b__5, addr 0x1862e1c, size 0x9c, virtual false, abstract: false, final false
inline void _RemoveSessionUpVote_b__5(::VROSC::Error  error) ;

